In [1]:
import pandas as pd
import numpy as np

In [12]:
df = pd.read_csv('dataset/Social_Network_Ads.csv')

In [13]:
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [14]:
df.isnull().sum()

User ID            0
Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [15]:
df.fillna(method = 'bfill',inplace = True)

In [16]:
df.isnull().sum()

User ID            0
Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [17]:
df.dropna(inplace = True)

In [18]:
df.isnull().sum()

User ID            0
Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [20]:
df.drop(columns=['User ID'],inplace = True)

In [21]:
df

     Gender  Age  EstimatedSalary  Purchased
0      Male   19            19000          0
1      Male   35            20000          0
2    Female   26            43000          0
3    Female   27            57000          0
4      Male   19            76000          0
..      ...  ...              ...        ...
395  Female   46            41000          1
396    Male   51            23000          1
397  Female   50            20000          1
398    Male   36            33000          0
399  Female   49            36000          1

[400 rows x 4 columns]

In [26]:
x = pd.DataFrame(df.iloc[:,0:3])
x

     Gender  Age  EstimatedSalary
0      Male   19            19000
1      Male   35            20000
2    Female   26            43000
3    Female   27            57000
4      Male   19            76000
..      ...  ...              ...
395  Female   46            41000
396    Male   51            23000
397  Female   50            20000
398    Male   36            33000
399  Female   49            36000

[400 rows x 3 columns]

In [28]:
y = df.iloc[:,-1]
y

0      0
1      0
2      0
3      0
4      0
      ..
395    1
396    1
397    1
398    0
399    1
Name: Purchased, Length: 400, dtype: int64

In [24]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer

In [29]:
tr = ColumnTransformer(transformers = [
    ('t1',OneHotEncoder(drop = 'first',sparse=False),['Gender'])
],remainder = "passthrough")

In [32]:
a = tr.fit_transform(df)

In [33]:
df = pd.DataFrame(a)

In [34]:
df

       0     1        2    3
0    1.0  19.0  19000.0  0.0
1    1.0  35.0  20000.0  0.0
2    0.0  26.0  43000.0  0.0
3    0.0  27.0  57000.0  0.0
4    1.0  19.0  76000.0  0.0
..   ...   ...      ...  ...
395  0.0  46.0  41000.0  1.0
396  1.0  51.0  23000.0  1.0
397  0.0  50.0  20000.0  1.0
398  1.0  36.0  33000.0  0.0
399  0.0  49.0  36000.0  1.0

[400 rows x 4 columns]

In [35]:
x = pd.DataFrame(df.iloc[:,0:3])
x

       0     1        2
0    1.0  19.0  19000.0
1    1.0  35.0  20000.0
2    0.0  26.0  43000.0
3    0.0  27.0  57000.0
4    1.0  19.0  76000.0
..   ...   ...      ...
395  0.0  46.0  41000.0
396  1.0  51.0  23000.0
397  0.0  50.0  20000.0
398  1.0  36.0  33000.0
399  0.0  49.0  36000.0

[400 rows x 3 columns]

In [36]:
y = df.iloc[:,-1]
y

0      0.0
1      0.0
2      0.0
3      0.0
4      0.0
      ...
395    1.0
396    1.0
397    1.0
398    0.0
399    1.0
Name: 3, Length: 400, dtype: float64

In [37]:
from sklearn.model_selection import train_test_split

In [38]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2,random_state = 2)

In [39]:
x_train

       0     1         2
205  0.0  47.0   47000.0
354  1.0  36.0   99000.0
3    0.0  27.0   57000.0
264  1.0  48.0   90000.0
194  1.0  28.0   89000.0
..   ...   ...       ...
299  1.0  46.0  117000.0
22   1.0  48.0   41000.0
72   0.0  20.0   23000.0
15   1.0  29.0   80000.0
168  1.0  29.0  148000.0

[320 rows x 3 columns]

In [40]:
x_test

       0     1         2
94   0.0  29.0   83000.0
32   0.0  21.0   16000.0
225  1.0  37.0   53000.0
157  1.0  29.0   75000.0
356  1.0  54.0   70000.0
..   ...   ...       ...
188  1.0  35.0   72000.0
223  1.0  60.0  102000.0
65   1.0  24.0   58000.0
262  0.0  55.0  125000.0
186  0.0  20.0   82000.0

[80 rows x 3 columns]

In [41]:
y_train

205    0.0
354    1.0
3      0.0
264    1.0
194    0.0
      ...
299    1.0
22     1.0
72     0.0
15     0.0
168    1.0
Name: 3, Length: 320, dtype: float64

In [42]:
y_test

94     0.0
32     0.0
225    0.0
157    0.0
356    1.0
      ...
188    0.0
223    1.0
65     0.0
262    1.0
186    0.0
Name: 3, Length: 80, dtype: float64

In [43]:
from sklearn.svm import SVC

In [44]:
s = SVC()

In [45]:
s.fit(x_train,y_train)

SVC()

In [48]:
z = s.predict(x_test)

In [47]:
from sklearn.metrics import accuracy_score

In [49]:
accuracy_score(y_test,z)

0.725